---
kind: enumMember
id: F:Autodesk.Revit.DB.OpeningWrappingCondition.ExteriorAndInterior
enum: Autodesk.Revit.DB.OpeningWrappingCondition
source: html/f8e17ac3-c77b-f42c-88e8-2779daa726c7.htm
---
# Autodesk.Revit.DB.OpeningWrappingCondition.ExteriorAndInterior

Both interior and exterior shell layers participate in wrapping at openings.